DataProcessors/ПроксиСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ПроксиСервера</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПроксиСервера_Приоритеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПроксиСервера_Приоритеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриоритетТелеграм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроксиСервера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПроксиСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ПроксиСервера</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПроксиСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПроксиСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Comment>Протокол для которого можно использовать, если не заполнено то для всех (вводить один протокол маленькими буквами, без проболев)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПроксиСервера/Ext/ObjectModule.bsl
Процедура ОбновитьСписокПроксиЕслиНетНиОдногоСПриоритетомТелеграмаВыше0(Оборудование = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПроксиСервера_Приоритеты.ПроксиСервер КАК ПроксиСервер,
	               |	ПроксиСервера_Приоритеты.ПриоритетТелеграм КАК ПриоритетТелеграм
	               |ИЗ
	               |	РегистрСведений.ПроксиСервера_Приоритеты КАК ПроксиСервера_Приоритеты
	               |ГДЕ
	               |	ПроксиСервера_Приоритеты.ПриоритетТелеграм > 0";
	
	Если Запрос.Выполнить().Пустой() Тогда
		ДополнитьСписокПроксиСfreeproxylistИспользуяБесплатныйАПИ();
		ДополнитьСписокПроксиСspysИспользуяБесплатныйАПИ();		
	КонецЕсли;
	                                                                       	 
КонецПроцедуры


Функция ДополнитьСписокПроксиСfreeproxylistИспользуяБесплатныйАПИ() Экспорт
	
	//https://www.freeproxy-list.ru/api/proxy?anonymity=false&token=demo

	Сервер = "freeproxy-list.ru";
	Ресурс = "api/proxy?anonymity=false&token=demo"; 				
	
	Соединение = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL); 
	Запрос = Новый HTTPЗапрос(Ресурс);
    Запрос.Заголовки.Вставить("Connection", "keep-alive"); 
    Запрос.Заголовки.Вставить("Content-Type", "multipart/form-data;");       
    
	Ответ = Соединение.Получить(Запрос);
	СтрокаСПроксиСерверами = Ответ.ПолучитьТелоКакСтроку();
	
	Для Счетчик = 1 По СтрЧислоСтрок(СтрокаСПроксиСерверами) Цикл
   		ТекСтрока = СтрПолучитьСтроку(СтрокаСПроксиСерверами, Счетчик);
		ПозицияРазделителя = СтрНайти(ТекСтрока, ":"); 
		АдресПрокси = Лев(ТекСтрока, ПозицияРазделителя - 1); 
		НомерПорта = Число(Сред(ТекСтрока, ПозицияРазделителя + 1));
		 
		Если НомерПорта = 80 или НомерПорта = 8080 Тогда 
			
			ЗапросПрокси = Новый Запрос();
			ЗапросПрокси.Текст = "ВЫБРАТЬ
			                     |	ПроксиСервера.Ссылка КАК Ссылка
			                     |ИЗ
			                     |	Справочник.ПроксиСервера КАК ПроксиСервера
			                     |ГДЕ
			                     |	ПроксиСервера.АдресПроксиСервера = &АдресПроксиСервера
			                     |	И ПроксиСервера.ПортПроксиСервера = &ПортПроксиСервера";
			ЗапросПрокси.УстановитьПараметр("АдресПроксиСервера", АдресПрокси);
			ЗапросПрокси.УстановитьПараметр("ПортПроксиСервера", НомерПорта);

			Если ЗапросПрокси.Выполнить().Пустой() Тогда // Добавим новый прокси в нашу базу
				НовыйПрокси = Справочники.ПроксиСервера.СоздатьЭлемент();
				НовыйПрокси.Наименование = АдресПрокси; 
				НовыйПрокси.АдресПроксиСервера = АдресПрокси;
				НовыйПрокси.ПортПроксиСервера = НомерПорта;
				НовыйПрокси.Протокол = "https";
				НовыйПрокси.МожноИспользовать = Истина;
				НовыйПрокси.Записать();	
				
				МенеджерЗаписи = РегистрыСведений.ПроксиСервера_Приоритеты.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ПроксиСервер = НовыйПрокси.Ссылка;
				МенеджерЗаписи.ПриоритетТелеграм = 300;
				МенеджерЗаписи.Записать();
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции

Функция ДополнитьСписокПроксиСspysИспользуяБесплатныйАПИ() Экспорт
	
	//http://spys.me/proxy.txt

	Сервер = "spys.me";
	Ресурс = "proxy.txt"; 				
	
	Соединение = Новый HTTPСоединение(Сервер,,,,,,); 
	Запрос = Новый HTTPЗапрос(Ресурс);
    Запрос.Заголовки.Вставить("Connection", "keep-alive"); 
    Запрос.Заголовки.Вставить("Content-Type", "multipart/form-data;");       
    
	Ответ = Соединение.Получить(Запрос);
	СтрокаСПроксиСерверами = Ответ.ПолучитьТелоКакСтроку();
	
	Для Счетчик = 10 По СтрЧислоСтрок(СтрокаСПроксиСерверами) Цикл
   		ТекСтрока = СтрПолучитьСтроку(СтрокаСПроксиСерверами, Счетчик);   
		Если Не ЗначениеЗаполнено(ТекСтрока) Тогда 
			Прервать;
		КонецЕсли;
		ПозицияРазделителя = СтрНайти(ТекСтрока, ":");
		ПозицияПробела = СтрНайти(ТекСтрока, " ");
		АдресПрокси = Лев(ТекСтрока, ПозицияРазделителя - 1); 
		НомерПорта = Число(Сред(ТекСтрока, ПозицияРазделителя + 1, ПозицияПробела - ПозицияРазделителя));
		Страна = Сред(ТекСтрока, ПозицияПробела + 1, 2); 
		Если СтрНайти(ТекСтрока, "S") > 0 И СтрНайти(ТекСтрока, "H") > 0 Тогда 
			
			ЗапросПрокси = Новый Запрос();
			ЗапросПрокси.Текст = "ВЫБРАТЬ
			                     |	ПроксиСервера.Ссылка КАК Ссылка
			                     |ИЗ
			                     |	Справочник.ПроксиСервера КАК ПроксиСервера
			                     |ГДЕ
			                     |	ПроксиСервера.АдресПроксиСервера = &АдресПроксиСервера
			                     |	И ПроксиСервера.ПортПроксиСервера = &ПортПроксиСервера";
			ЗапросПрокси.УстановитьПараметр("АдресПроксиСервера", АдресПрокси);
			ЗапросПрокси.УстановитьПараметр("ПортПроксиСервера", НомерПорта);

			Если ЗапросПрокси.Выполнить().Пустой() Тогда // Добавим новый прокси в нашу базу
				НовыйПрокси = Справочники.ПроксиСервера.СоздатьЭлемент();
				НовыйПрокси.Наименование = АдресПрокси; 
				НовыйПрокси.АдресПроксиСервера = АдресПрокси;
				НовыйПрокси.ПортПроксиСервера = НомерПорта;
				НовыйПрокси.Протокол = "https";
				НовыйПрокси.МожноИспользовать = Истина;
				НовыйПрокси.Страна = Страна;
				НовыйПрокси.Записать();	
				
				МенеджерЗаписи = РегистрыСведений.ПроксиСервера_Приоритеты.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ПроксиСервер = НовыйПрокси.Ссылка;
				МенеджерЗаписи.ПриоритетТелеграм = 300;
				МенеджерЗаписи.Записать();

			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции
